_posts/2015-08-10-cons-cells-in-lfe.html
---
layout: post
title:  "Cons Cells in Lisp Flavoured Erlang"
date:   Thu 2015-08-10 19:29:09 CDT 2015
---

<p>
Just as you'd expect from <a href="http://learnyousomeerlang.com/starting-out-for-real#lists">Erlang</a> or <a href="http://clojure.org/lisps">another Lisp</a>, in <a href="http://lfe.gitbooks.io/tutorial/content/sequential/lists.html">LFE</a>, lists are composed of
<a href="http://cs.gmu.edu/~sean/lisp/cons/"><i>cons cells</i></a> and when you use pattern matching to bind the head and tail of a
singleton list, <code>head</code> holds the single element and <code>tail</code> is the empty list.
</p>

<div class="org-src-container">

<pre class="src src-lfe">&gt; <span style="color: #A1EFE4;">(</span><span style="color: #F92672;">let</span> <span style="color: #E6DB74;">(</span><span style="color: #66D9EF;">(</span>`<span style="color: #FD971F;">(</span>,head . ,tail<span style="color: #FD971F;">)</span> '<span style="color: #FD971F;">(</span>a-single-element<span style="color: #FD971F;">)</span><span style="color: #66D9EF;">)</span><span style="color: #E6DB74;">)</span>
    <span style="color: #E6DB74;">(</span>lfe_io:format '<span style="color: #E6DB74;">"Head: ~w~nTail: ~w~n"</span> `<span style="color: #66D9EF;">(</span>,head ,tail<span style="color: #66D9EF;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
</pre>
</div>

<pre class="example">
Head: a-single-element
Tail: ()
ok
</pre>

<p>
We can confirm this by checking that a <i>cons cell</i> of the atom
<code>a-single-element</code> and the empty list is <a href="http://erlang.org/doc/reference_manual/expressions.html#id80197">exactly equal to</a> a singleton list of
the same atom.
</p>

<div class="org-src-container">

<pre class="src src-lfe">&gt; <span style="color: #A1EFE4;">(</span>=:= <span style="color: #E6DB74;">(</span><span style="color: #F92672;">cons</span> 'a-single-element '<span style="color: #66D9EF;">()</span><span style="color: #E6DB74;">)</span> '<span style="color: #E6DB74;">(</span>a-single-element<span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
</pre>
</div>

<pre class="example">
true
</pre>
